; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-97)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b5)
    (on b5 b19)
    (on b19 b20)
    (on b20 b21)
    (on b21 b3)
    (on b3 b28)
    (on b28 b22)
    (on b22 b16)
    (on b16 b4)
    (on b4 b15)
    (on b15 b7)
    (on b7 b17)
    (on b17 b8)
    (on b8 b23)
    (on b23 b27)
    (on b27 b24)
    (on b24 b10)
    (on b10 b13)
    (on b13 b26)
    (on b26 b11)
    (on b11 b25)
    (on b25 b12)
    (on b12 b29)
    (on b29 b14)
    (on b14 b2)
    (on b2 b6)
    (on b6 b1)
    (on-table b1)
    (clear b18)
    (on b18 b9)
    (on-table b9))
 (:goal (and 
(on-table b21)
))
)

; plan
1. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 0 of 1
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
3. (unstack b19 b20)
   deleted: (on b19 b20) (clear b19) (arm-empty)
   added: (holding b19) (clear b20)
   goals met: 0 of 1
4. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
5. (unstack b20 b21)
   deleted: (on b20 b21) (clear b20) (arm-empty)
   added: (holding b20) (clear b21)
   goals met: 0 of 1
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 1
7. (unstack b21 b3)
   deleted: (on b21 b3) (clear b21) (arm-empty)
   added: (holding b21) (clear b3)
   goals met: 0 of 1
8. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 1
